In [13]:
#importing libararies
import pandas as pd
import numpy as np
import datetime
from sklearn import linear_model

             Age      Height      Weight       Premium
count  89.000000   83.000000   89.000000     89.000000
mean   58.797753   74.460120   81.921348  34325.842697
std    21.813872   29.021283   28.654376   7742.702255
min    20.000000   33.000000   40.000000  15000.000000
25%    40.000000   55.440000   60.000000  30000.000000
50%    62.000000   67.880000   77.000000  35000.000000
75%    78.000000   80.940000   96.000000  41000.000000
max    90.000000  172.720000  160.000000  45000.000000

    Age  Height  Weight  Premium
0    20  162.56      70    15000
1    20  172.72      95    16000
2    20  167.64      78    17000
3    21     NaN     110    18000
4    22  157.48      85    19000
..  ...     ...     ...      ...
84   88   65.00     129    44000
85   88   33.00     123    44000
86   89   53.00     137    45000
87   89   55.33     125    45000
88   90   56.55     124    45000

[89 rows x 4 columns]

In [ ]:
data= pd.read_csv('DataSet.csv')
print(data.describe())
data

In [14]:
# Anayzing data
mean_height = data.Height.mean()

In [15]:
data.Height

0     162.56
1     172.72
2     167.64
3        NaN
4     157.48
       ...
84     65.00
85     33.00
86     53.00
87     55.33
88     56.55
Name: Height, Length: 89, dtype: float64

In [16]:
#to fill the null value u can  take the mean value and add in null points 
data.Height = data.Height.fillna(mean_height)

In [17]:
data.Height[0:55]

0     162.56000
1     172.72000
2     167.64000
3      74.46012
4     157.48000
5      74.46012
6     157.66000
7     158.00000
8      99.99000
9     100.00000
10     60.67000
11     69.99000
12     73.00000
13     87.97000
14     74.46012
15     84.55000
16     44.33000
17     56.78000
18     67.87000
19     74.46012
20     74.46012
21     74.46012
22     77.67000
23     67.44000
24     44.67000
25     78.98000
26     79.54000
27     98.23000
28     55.55000
29     55.89000
30     44.88000
31     78.44000
32     67.23000
33     82.34000
34     83.45000
35     98.34000
36     72.00000
37     71.00000
38     69.00000
39     68.00000
40     67.00000
41     63.00000
42     64.00000
43     88.00000
44     67.00000
45     55.00000
46     77.00000
47     45.00000
48     54.00000
49     86.00000
50     78.90000
51     56.99000
52     49.88000
53     66.44000
54     67.88000
Name: Height, dtype: float64

In [18]:
data

    Age     Height  Weight  Premium
0    20  162.56000      70    15000
1    20  172.72000      95    16000
2    20  167.64000      78    17000
3    21   74.46012     110    18000
4    22  157.48000      85    19000
..  ...        ...     ...      ...
84   88   65.00000     129    44000
85   88   33.00000     123    44000
86   89   53.00000     137    45000
87   89   55.33000     125    45000
88   90   56.55000     124    45000

[89 rows x 4 columns]

In [20]:
# Now i make a methode of linear regression
reg = linear_model.LinearRegression()

In [25]:
# Now fitting the dependent and indepedent variable 
reg.fit(data[['Age','Height','Weight']],data['Premium'])

LinearRegression()

In [26]:
#Now for coffient
reg.coef_

array([350.86099966, -29.26526209, -23.23789215])

In [27]:
#For intercept
reg.intercept_

17778.77876646552

In [30]:
#Now want to predict
reg.predict([[27,100.00,44]])

C:\Users\Junaid\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([23303.03229352])

In [45]:
#data.head(20)

In [47]:
#menual Formula

27*350.86099966 + -29.26526209*100.00 + 44*-23.23789215 +17778.77876646552

23303.03229368552